000100020131PGM
000200151215             DCL        VAR(&LIB)      TYPE(*CHAR) LEN(10) VALUE('TH_SMPL')
000300030704             CPYF       FROMFILE(ARTICLE) TOFILE(&LIB/ARTICLESAV)
000400020131/* update master update 3*/
000500020131ENDPGM